app/controllers/products_controller.rb

SELECT  "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @products = Product.all